request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
		 xmlns:tns="http://localhost:8080/ws/">
   <soapenv:Header/>
   <soapenv:Body>
      <tns:getUserRequest>
         <tns:username>jd</tns:username>
         <tns:password>1234</tns:password>
      </tns:getUserRequest>
   </soapenv:Body>
</soapenv:Envelope>
